/*!
@file Scene.h
@brief シーン
*/
#pragma once

#include "stdafx.h"

namespace basecross{

	//--------------------------------------------------------------------------------------
	///	ゲームシーン
	//--------------------------------------------------------------------------------------
	class Scene : public SceneBase{
	public:
		//--------------------------------------------------------------------------------------
		/*!
		@brief コンストラクタ
		*/
		//--------------------------------------------------------------------------------------
		Scene() :SceneBase(){}
		//--------------------------------------------------------------------------------------
		/*!
		@brief デストラクタ
		*/
		//--------------------------------------------------------------------------------------
		virtual ~Scene();
		//--------------------------------------------------------------------------------------
		/*!
		@brief 初期化
		@return	なし
		*/
		//--------------------------------------------------------------------------------------
		virtual void OnCreate() override;
		//--------------------------------------------------------------------------------------
		/*!
		@brief イベント取得
		@return	なし
		*/
		//--------------------------------------------------------------------------------------
		virtual void OnEvent(const shared_ptr<Event>& event) override;

		void GameResourses();

		void SetLastPlayStage(int playStage);//最後にプレイしたステージを返すセッター

		int GetSelOneSize();//１つのセル座標がワールド座標ではどんな大きさかを返すゲッター
		int GetLastPlayStage();//最後にプレイしたステージを返すゲッター

	private:
		int m_OneBox = 10;//１つのボックスの大きさ
		int m_lastPlayStage = 1;//最後にプレイしたステージ
	};

}

//end basecross
